---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InsertComponentViewError
source: html/3cd7e56a-f168-5a3e-2e53-92a8d842ea5f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InsertComponentViewError Property

This type of Component cannot be placed in Elevation or Section view

## Syntax (C#)
```csharp
public static FailureDefinitionId InsertComponentViewError { get; }
```